---
kind: type
id: T:Autodesk.Revit.DB.Structure.BendingDetailAngularDimensionsDisplayOptions
source: html/78ee1054-d537-da6f-f244-adc2bdc84408.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailAngularDimensionsDisplayOptions

Describes the angular dimensions display options.

## Syntax (C#)
```csharp
public enum BendingDetailAngularDimensionsDisplayOptions
```